README.org
#+title: Emacs configuration
#+author: @lucashuguet
#+property: header-args :tangle init.el
#+auto_tangle: t

* Contents :TOC:
- [[#pkg-management][Pkg Management]]
  - [[#melpa][melpa]]
  - [[#use-package][use-package]]
- [[#appearance][Appearance]]
  - [[#basic-configuration][basic configuration]]
  - [[#fonts][fonts]]
  - [[#ligatures][ligatures]]
  - [[#theme][theme]]
  - [[#modeline][modeline]]
  - [[#dashboard][dashboard]]
  - [[#vertico][vertico]]
  - [[#which-key][which-key]]
- [[#keymaps][Keymaps]]
  - [[#evil][evil]]
  - [[#general][general]]
  - [[#keys][keys]]
- [[#emacs-builtins][Emacs builtins]]
  - [[#custom-file][custom-file]]
  - [[#backups][backups]]
  - [[#dired][dired]]
  - [[#recentf][recentf]]
  - [[#warnings][warnings]]
  - [[#utf8][utf8]]
- [[#org-mode][Org mode]]
  - [[#babel][babel]]
  - [[#extentions][extentions]]
- [[#code][Code]]
  - [[#minor-modes][minor modes]]
  - [[#eglot][eglot]]
  - [[#corfu][corfu]]
  - [[#magit][magit]]
  - [[#yasnippet][yasnippet]]
  - [[#treemacs][treemacs]]
  - [[#rust][rust]]
  - [[#python][python]]
  - [[#web][web]]
  - [[#docker][docker]]
  - [[#nix][nix]]
  - [[#yaml][yaml]]

* Pkg Management
** melpa
#+begin_src emacs-lisp
  (require 'package)
  (add-to-list 'package-archives
               '("melpa" . "https://melpa.org/packages/") t)
  (package-initialize)
#+end_src
** use-package
#+begin_src emacs-lisp
  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))

  (setq use-package-expand-minimally t)
#+end_src
* Appearance
** basic configuration
#+begin_src emacs-lisp
  (setq inhibit-startup-message t)

  (tool-bar-mode -1)
  (menu-bar-mode -1)

  (scroll-bar-mode -1)
  (customize-set-variable 'scroll-bar-mode nil)
  (customize-set-variable 'horizontal-scroll-bar-mode nil)

  (global-hl-line-mode t)

  (add-to-list 'default-frame-alist
               '(vertical-scroll-bars . nil))


  ;; define a secondary theme used by SPC h t keybinding
  (add-to-list 'custom-enabled-themes 'doom-one-light t)

  ;; (line-number-mode t)
  (global-display-line-numbers-mode t)
#+end_src
** fonts
#+begin_src emacs-lisp
  (use-package nerd-icons
    :ensure t
    :custom
    (nerd-icons-font-family "FantasqueSansM Nerd Font"))

  (add-to-list 'default-frame-alist '(font . "FantasqueSansM Nerd Font-16"))

  (use-package unicode-fonts
    :ensure t
    :init
    (unicode-fonts-setup))
#+end_src
** ligatures
#+begin_src emacs-lisp
  (dolist (char/ligature-re
           `((?-  . ,(rx (or (or "-->" "-<<" "->>" "-|" "-~" "-<" "->") (+ "-"))))
             (?/  . ,(rx (or (or "/==" "/=" "/>" "/**" "/*") (+ "/"))))
             (?*  . ,(rx (or (or "*>" "*/") (+ "*"))))
             (?<  . ,(rx (or (or "<<=" "<<-" "<|||" "<==>" "<!--" "<=>" "<||" "<|>" "<-<"
                                 "<==" "<=<" "<-|" "<~>" "<=|" "<~~" "<$>" "<+>" "</>"
                                 "<*>" "<->" "<=" "<|" "<:" "<>"  "<$" "<-" "<~" "<+"
                                 "</" "<*")
                             (+ "<"))))
             (?:  . ,(rx (or (or ":?>" "::=" ":>" ":<" ":?" ":=") (+ ":"))))
             (?=  . ,(rx (or (or "=>>" "==>" "=/=" "=!=" "=>" "=:=") (+ "="))))
             (?!  . ,(rx (or (or "!==" "!=") (+ "!"))))
             (?>  . ,(rx (or (or ">>-" ">>=" ">=>" ">]" ">:" ">-" ">=") (+ ">"))))
             (?&  . ,(rx (+ "&")))
             (?|  . ,(rx (or (or "|->" "|||>" "||>" "|=>" "||-" "||=" "|-" "|>"
                                 "|]" "|}" "|=")
                             (+ "|"))))
             (?.  . ,(rx (or (or ".?" ".=" ".-" "..<") (+ "."))))
             (?+  . ,(rx (or "+>" (+ "+"))))
             (?\[ . ,(rx (or "[<" "[|")))
             (?\{ . ,(rx "{|"))
             (?\? . ,(rx (or (or "?." "?=" "?:") (+ "?"))))
             (?#  . ,(rx (or (or "#_(" "#[" "#{" "#=" "#!" "#:" "#_" "#?" "#(")
                             (+ "#"))))
             (?\; . ,(rx (+ ";")))
             (?_  . ,(rx (or "_|_" "__")))
             (?~  . ,(rx (or "~~>" "~~" "~>" "~-" "~@")))
             (?$  . ,(rx "$>"))
             (?^  . ,(rx "^="))
             (?\] . ,(rx "]#"))))
    (let ((char (car char/ligature-re))
          (ligature-re (cdr char/ligature-re)))
      (set-char-table-range composition-function-table char
                            `([,ligature-re 0 font-shape-gstring]))))
#+end_src
** theme
#+begin_src emacs-lisp
  (use-package doom-themes
    :ensure t
    :config
    (load-theme 'doom-ayu-dark t)
    (doom-themes-org-config))
#+end_src
** modeline
#+begin_src emacs-lisp
  (use-package doom-modeline
    :ensure t
    :hook (after-init . doom-modeline-mode)
    :custom
    (doom-modeline-height 30))
#+end_src
** dashboard
#+begin_src emacs-lisp
  (use-package dashboard
    :ensure t
    :custom
    (dashboard-banner-logo-title "Welcome to Emacs")
    (dashboard-startup-banner 'logo)
    (dashboard-icon-type 'nerd-icons)
    (dashboard-display-icons-p t)
    (dashboard-set-file-icons t)
    (dashboard-set-heading-icons t)
    (dashboard-show-shortcuts t)
    (dashboard-center-content t)
    (initial-buffer-choice (lambda () (get-buffer-create dashboard-buffer-name)))
    :config
    (dashboard-setup-startup-hook)
    :init
    (dashboard-open))
#+end_src
** vertico
#+begin_src emacs-lisp
  (use-package vertico
    :ensure t
    :custom
    (vertico-count 15)
    :config
    (vertico-mode))
#+end_src
** which-key
#+begin_src emacs-lisp
  (use-package which-key
    :ensure t
    :config
    (which-key-mode t))
#+end_src
* Keymaps
** evil
Vim motions emulator in emacs
#+begin_src emacs-lisp
  (use-package evil
    :ensure t
    :init
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-vsplit-window-right t)
    (setq evil-split-window-below t)
    (setq evil-default-cursor t)
    (setq evil-want-c-i-jump nil) ;; fixes indent in org mode
    (evil-mode t))

  (use-package evil-collection
    :ensure t
    :after evil
    :config
    (setq evil-collection-mode-list '(dashboard dired ibuffer magit))
    (evil-collection-init))

  (use-package evil-commentary
    :ensure t
    :after evil
    :init (evil-commentary-mode))

  (use-package vimish-fold
    :ensure t
    :after evil)

  (use-package evil-vimish-fold
    :ensure t
    :after vimish-fold
    :hook ((prog-mode conf-mode text-mode) . evil-vimish-fold-mode))

  (use-package evil-anzu
    :ensure t
    :config
    (global-anzu-mode))
#+end_src
** general
#+begin_src emacs-lisp
  (use-package general
    :ensure t
    :config
    (general-evil-setup t))
#+end_src
