README.org
* Org mode
#+begin_src emacs-lisp
  (setq org-startup-folded t)
  (setq org-hidden-keywords '(title))
  (setq org-return-follows-link t)

  (setq org-todo-keywords
        (quote ((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d)")
                (sequence "WAITING(w@/!)" "HOLD(h@/!)" "|" "CANCELLED(c@/!)"))))

  (setq-default org-enforce-todo-dependencies t)

  (setq org-todo-keyword-faces
        (quote (("TODO" :foreground "indian red" :weight bold)
                ("NEXT" :foreground "light blue" :weight bold)
                ("DONE" :foreground "light green" :weight bold)
                ("WAITING" :foreground "chocolate" :weight bold)
                ("CANCELLED" :foreground "dim gray" :weight bold))))

  (setq-default org-export-with-todo-keywords nil)

  (with-eval-after-load 'org-superstar
    (setq org-superstar-item-bullet-alist
          '((?* . ?•)
            (?+ . ?➤)
            (?- . ?•)))

    (setq org-superstar-leading-bullet ?\s)
    (setq org-superstar-headline-bullets-list
          '("◉" "◈" "○" "▷"))
    (org-superstar-restart))


  (setq org-hide-leading-stars nil)
  (setq org-indent-mode-turns-on-hiding-stars nil)

  (setq org-ellipsis " ▼ ")

  (setq org-hide-emphasis-markers t)

  (defun my/buffer-face-mode-variable ()
    "Set font to a variable width (proportional) fonts in current buffer"
    (interactive)
    (setq buffer-face-mode-face '(:family "FantasqueSansM Nerd Font"
                                          :height 160
                                          :width normal))
    (buffer-face-mode))

  (defun my/set-faces-org ()
    (setq org-hidden-keywords '(title))
    (set-face-attribute 'org-level-8 nil :weight 'bold :inherit 'default)

    (set-face-attribute 'org-level-7 nil :inherit 'org-level-8)
    (set-face-attribute 'org-level-6 nil :inherit 'org-level-8)
    (set-face-attribute 'org-level-5 nil :inherit 'org-level-8)
    (set-face-attribute 'org-level-4 nil :inherit 'org-level-8)

    (set-face-attribute 'org-level-3 nil :inherit 'org-level-8 :height 1.2) ;\large
    (set-face-attribute 'org-level-2 nil :inherit 'org-level-8 :height 1.44) ;\Large
    (set-face-attribute 'org-level-1 nil :inherit 'org-level-8 :height 1.728) ;\LARGE

    (setq org-cycle-level-faces nil)
    (setq org-n-level-faces 4)

    (set-face-attribute 'org-document-title nil
                        :height 2.074
                        :foreground 'unspecified
                        :inherit 'org-level-8))

  (defun my/set-keyword-faces-org ()
    (mapc (lambda (pair) (push pair prettify-symbols-alist))
          '(;; Syntax
            ("TODO" .     "")
            ("DONE" .     "")
            ("WAITING" .  "")
            ("HOLD" .     "")
            ("NEXT" .     "")
            ("CANCELLED" . "")
            ("#+begin_quote" . "“")
            ("#+end_quote" . "”")))
    )

  (defun my/style-org ()
    (my/set-faces-org)
    (my/set-keyword-faces-org))

  (add-hook 'org-mode-hook 'my/style-org)
  (add-hook 'org-mode-hook 'org-indent-mode)

  (setq org-format-latex-options (plist-put org-format-latex-options :scale 2.0))
#+end_src
** babel
#+begin_src emacs-lisp
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((python . t))) 
#+end_src
** extentions
**** org-auto-tangle
#+begin_src emacs-lisp
  (use-package org-auto-tangle
    :ensure t
    :hook (org-mode . org-auto-tangle-mode))
#+end_src
**** org-superstar
#+begin_src emacs-lisp
  (use-package org-superstar
    :ensure t
    :config
    (add-hook 'org-mode-hook 'org-superstar-mode))
#+end_src
**** evil-org
#+begin_src emacs-lisp
  (use-package evil-org
    :ensure t
    :after org
    :config
    (require 'evil-org-agenda)
    (add-hook 'org-mode-hook 'evil-org-mode)
    (evil-org-agenda-set-keys))
#+end_src
**** toc-org
#+begin_src emacs-lisp
  (use-package toc-org
    :ensure t
    :config
    (add-hook 'org-mode-hook 'toc-org-mode))
#+end_src
**** org-roam
#+begin_src emacs-lisp
  (use-package org-roam
    :ensure t
    :custom
    (org-roam-directory (file-truename "~/Documents/org/roam"))
    :bind (("C-c n l" . org-roam-buffer-toggle)
           ("C-c n f" . org-roam-node-find)
           ("C-c n g" . org-roam-graph)
           ("C-c n i" . org-roam-node-insert)
           ("C-c n c" . org-roam-capture)
           ;; Dailies
           ("C-c n j" . org-roam-dailies-capture-today))
    :config
    ;; If you're using a vertical completion framework, you might want a more informative completion interface
    (setq org-roam-node-display-template (concat "${title:*} " (propertize "${tags:10}" 'face 'org-tag)))
    (org-roam-db-autosync-mode)
    ;; If using org-roam-protocol
    (require 'org-roam-protocol))
#+end_src
* Code
** minor modes
#+begin_src emacs-lisp
  (electric-pair-mode t)
  (electric-indent-mode t)

  (global-auto-revert-mode)

  (setq indent-tabs-mode nil)
#+end_src
** eglot
#+begin_src emacs-lisp
  (use-package eglot
    :ensure t
    :custom
    (eldoc-echo-area-use-multiline-p nil))
#+end_src
** corfu
#+begin_src emacs-lisp
  (use-package corfu
    :ensure t
    :custom
    (corfu-cycle t)
    (corfu-auto t)
    (corfu-auto-prefix 2)
    (corfu-auto-delay 0.25)
    (corfu-quit-at-boundary 'separator)
    (corfu-preview-current 'insert)
    (corfu-preselect-first nil)
    (corfu-popupinfo-mode t)
    :bind (:map corfu-map
                ("M-SPC" . corfu-insert-separator)
                ("RET" . nil)
                ("TAB" . corfu-next)
                ([tab] . corfu-next)
                ("S-TAB" . corfu-previous)
                ([backtab] . corfu-previous)
                ("S-<return>" . corfu-insert))
    :init
    (global-corfu-mode))

  (use-package emacs
    :custom
    (tab-always-indent 'complete)
    (text-mode-ispell-word-completion nil)
    (read-extended-command-predicate #'command-completion-default-include-p))

  (use-package cape
    :ensure t
    :bind ("C-c p" . cape-prefix-map)
    :init
    (add-hook 'completion-at-point-functions #'cape-dabbrev)
    (add-hook 'completion-at-point-functions #'cape-file)
    (add-hook 'completion-at-point-functions #'cape-elisp-block))

  (use-package nerd-icons-corfu
    :ensure t
    :init
    (add-to-list 'corfu-margin-formatters #'nerd-icons-corfu-formatter))
#+end_src
** magit
#+begin_src emacs-lisp
  (use-package magit :ensure t)
#+end_src
** yasnippet
#+begin_src emacs-lisp
  (use-package yasnippet
    :ensure t
    :config
    (yas-global-mode 1))

  (use-package yasnippet-snippets
    :ensure t
    :after yasnippet)
#+end_src
** treemacs
#+begin_src emacs-lisp
  (use-package treemacs :ensure t)

  (use-package treemacs-nerd-icons
    :ensure t
    :config
    (treemacs-load-theme "nerd-icons"))

  (use-package treemacs-evil
    :ensure t
    :after (treemacs evil))
#+end_src
** rust
#+begin_src emacs-lisp
  (use-package rust-mode
    :ensure t
    :custom
    (rust-format-on-save t)
    (eglot-workspace-configuration
     '(:rust-analyzer
       ( :procMacro ( :attributes (:enable t)
                      :enable t)
         :cargo (:buildScripts (:enable t))
         :diagnostics (:disabled ["unresolved-proc-macro"
                                  "unresolved-macro-call"]))))
    :mode (("\\.rs\\'" . rust-mode))
    :hook ((rust-mode . eglot-ensure)))
#+end_src
** python
#+begin_src emacs-lisp
  (use-package elpy
    :ensure t
    :custom
    (elpy-shell-echo-output nil)
    :mode (("\\.py\\'" . elpy-mode))
    :hook ((elpy-mode . eglot-ensure))
    :init
    (elpy-enable))
#+end_src
** web
#+begin_src emacs-lisp
  (use-package web-mode :ensure t)
#+end_src
** docker
#+begin_src emacs-lisp
  (use-package dockerfile-mode :ensure t)
#+end_src
** nix
#+begin_src emacs-lisp
  (use-package nix-mode
    :ensure t
    :mode (("\\.nix\\'" . nix-mode)))
#+end_src
** yaml
#+begin_src emacs-lisp
  (use-package yaml-mode
    :ensure t
    :mode (("\\.yml\\'" . yaml-mode)
           ("\\.yaml\\'" . yaml-mode)))
#+end_src
